Repository: Aerilius/sketchup-attribute-inspector
Catalog: ae_attributeinspector/Resources/*/attribute_inspector.strings
Languages: fr, zh_cn

source: Attribute Inspector
fr: Inspecteur d'attributs
zh_cn: 属性检查器

source: A viewer for entity and model attributes
fr: Un outil pour voir les attributs d'une entité ou du modèle
zh_cn: 实体和模型属性的查看器

source: Select an entity to view and edit its attribute dictionaries.
fr: Sélectionne une entité et voir ses dictionnaires d'attributs.
zh_cn: 选择要查看和编辑其属性字典的实体。

source: String
zh_cn: 弦

source: Integer
zh_cn: 整数

source: Float
zh_cn: 浮点数

source: Length
fr: Longueur
zh_cn: 长度

# Array
source: List
fr: Array
zh_cn: 表

source: Boolean
zh_cn: 布尔值

# NilClass
source: Null
zh_cn: 空值

# Geom::Point3d
source: Point
zh_cn: 点

# Geom::Vector3d
source: Vector
fr: Vecteur
zh_cn: 矢量

# Sketchup::Color
source: Color
fr: Couleur
zh_cn: 颜色

source: Time
fr: Temps
zh_cn: 时间

source: dictionary
fr: dictionnaire
zh_cn: 字典

source: attribute
fr: attribut
zh_cn: 属性

source: value
fr: valeur
zh_cn: 价值

source: type
zh_cn: 类型

source: Add attribute dictionary "%0"
fr: Ajouter le dictionnaire «%0»
zh_cn: 添加属性字典“%0”

source: Rename attribute dictionary "%0" to "%1"
fr: Renommer le dictionnaire «%0» en «%1»
zh_cn: 将属性字典“%0”重命名为“%1”

source: Remove attribute dictionary "%0"
fr: Enlever le dictionnaire «%0»
zh_cn: 删除属性字典“%0”

source: Set attribute "%0" to "%1"
fr: Mettre l'attribut «%0» à «%1»
zh_cn: 将属性“%0”设置为“%1”

source: Rename attribute "%0" to "%1"
fr: Renommer l'attribut «%0» en «%1»
zh_cn: 将属性“%0”重命名为“%1”

source: Remove attribute "%0"
fr: Enlever l'attribut «%0»
zh_cn: 删除属性“%0”

source: Attribute "%0" could not be renamed into "%1"
fr: L'attribut «%0» n'a pas pu être renommé «%1»
zh_cn: 无法将属性“%0”重命名为“%1”

source: "%0" is not a valid %1
fr: «%0» ne correspond pas au type %1
zh_cn: “0”不是有效的%1

source: Add a new dictionary
fr: Ajouter un nouveau dictionnaire
zh_cn: 添加新词典

source: Add a nested dictionary
fr: Ajouter un dictionnaire imbriqué
zh_cn: 添加嵌套字典

source: Rename the selected dictionary
fr: Renommer le dictionnaire sélectionné
zh_cn: 重命名所选词典

source: Remove the selected dictionary
fr: Enlever le dictionnaire sélectionné
zh_cn: 删除所选词典

source: Add a new attribute
fr: Ajouter un nouvel attribut
zh_cn: 添加新属性

source: Remove the selected attribute
fr: Enlever l'attribut sélectionné
zh_cn: 删除所选属性

source: No entities selected
zh_cn: 未选择任何实体

# No attribute dictionaries
source: This entity has not yet any attribute dictionaries.
zh_cn: 此实体还没有任何属性字典。

# No attribute dictionaries (2)
source: These entities have not yet any attribute dictionaries.
zh_cn: 这些实体还没有任何属性字典。

# No attributes
source: This dictionary has not yet any attributes.
zh_cn: 这本词典还没有任何属性。

# How to select other entity types
source: To view attributes of other entity types, select then option below and the use the materials browser to select a material, the layers manager to select a layer (radio box) or the scenes manager to select a scene (double-click).
fr: Pour voir d'autres types d'entités, sélectionne l'option si-dessous et utilise le navigateur de matérieaux pour sélectionner un matérial, le navigateur des calques pour sélectionner une calque (bouton radio) ou le navigateur des scènes pour sélectionner un scène (double-click).
zh_cn: 要查看其他实体类型的属性，请选择下面的选项，然后使用“材质浏览器”选择一种材质，使用“图层管理器”选择一个图层（单选框），或使用“场景管理器”选择一个场景（双击）。

source: drawing elements
fr: éléments de dessin
zh_cn: 绘图元素

source: component definitions
fr: définitions de composant
zh_cn: 个组件定义

source: materials
fr: matérieaux
zh_cn: 个材质

source: layers
fr: calques
zh_cn: 个图层

source: scenes
fr: scènes
zh_cn: 个场景

source: styles
zh_cn: 个样式

# Drawingelement
source: drawing elements
zh_cn: 绘图元素

source: component definition
fr: définition de composant
zh_cn: 个组件定义

source: material
fr: matérial
zh_cn: 个材质

source: layer
fr: calque
zh_cn: 个图层

# Page
source: scenes
zh_cn: 个场景

# Style
source: styles
zh_cn: 个样式

source: Choose a dictionary name:
fr: Choisissez un nom de dictionnaire :
zh_cn: 选择词典名称：

source: Ok
zh_cn: 好啊

source: Abort
fr: Annuler
zh_cn: 中止

source: When you change a grayed out value that is not shared by all selected entities, it will be added to all selected entities.
fr: Si une valeur grisée est changée, qui n'est pas partagée parmi toutes les entités sélectionnées, elle sera ajoutée à toutes les entités sélectionnées.
zh_cn: 当您更改不是由所有选定实体共享的灰色值时，它将添加到所有选定实体。

source: Allow editing grayed values
fr: Permets de changer des valeurs grisées
zh_cn: 允许编辑灰色值

source: JSON Tree
zh_cn: JSON树

source: JSON Source
zh_cn: JSON源程序

source: A dictionary with the same name already exists. Please choose a different name.
zh_cn: 同名词典已存在。请选择其他名称。

source: No entity selected
fr: Rien sélectionné
zh_cn: 未选择任何实体

source: entities
fr: entités
zh_cn: 实体

source: see also:
fr: vois aussi :
zh_cn: 参见：

source: currently selected %0
fr: %0 séléctionné(e) en ce moment
zh_cn: 当前选定的%0

source: model
fr: modèle
zh_cn: 模型

# ArcCurve
source: arc
zh_cn: 圆弧

# ArcCurves
source: arcs
zh_cn: 个圆弧

source: circle
fr: cercle
zh_cn: 圆圈

source: circles
fr: cercles
zh_cn: 个圆圈

source: curve
fr: courbe
zh_cn: 条曲线

source: curves
fr: courbes
zh_cn: 几个条曲线

source: edge
fr: arête
zh_cn: 边线

source: edges
fr: arêtes
zh_cn: 个条边线

source: face
zh_cn: 平面

source: faces
zh_cn: 个平面

source: group
fr: groupe
zh_cn: 组

source: groups
fr: groupes
zh_cn: 个组

source: component instance
fr: copie de composant
zh_cn: 组件实例

source: component instances
fr: copies de composant
zh_cn: 个组件实例

source: component definitions
fr: définitions de composant
zh_cn: 个组件定义

source: image
fr: images
zh_cn: 图片

source: images
zh_cn: 个图片

source: text
fr: texte
zh_cn: 文字

source: texts
fr: textes
zh_cn: 个文字

# ConstructionLine
source: construction lines
fr: arête de construction
zh_cn: 参考线

source: construction point
fr: point de construction
zh_cn: 辅助点

source: construction points
fr: points de construction
zh_cn: 个辅助点

# DimensionLinear
source: linear dimension
fr: Cotation linéaire
zh_cn: 线性尺寸

# DimensionLinears
source: linear dimensions
fr: Cotations linéaires
zh_cn: 个线性尺寸

source: section plane
fr: plan de section
zh_cn: 剖切面

source: section planes
fr: plans de sections
zh_cn: 个剖切面

source: materials
fr: matériaeux
zh_cn: 个材质

source: layers
fr: calques
zh_cn: 个图层

# ViewPage
source: scene
fr: scène
zh_cn: 场景

# ViewPages
source: scenes
fr: scènes
zh_cn: 个场景

source: texture
zh_cn: 纹理

source: textures
zh_cn: 个纹理

source: loop
fr: boucle
zh_cn: 循环

source: loops
fr: boucles
zh_cn: 个循环

source: EdgeUse
zh_cn: 边线使用

source: EdgeUses
zh_cn: 个边线使用

source: ComponentBehavior
zh_cn: 组件行为

source: ComponentBehaviors
zh_cn: 个组件行为

# AttributeDictionary
source: dictionary
fr: dictionnaire
zh_cn: 字典

# AttributeDictionarys
source: dictionaries
fr: dictionnaires
zh_cn: 个字典

# SkpStyle
source: style
zh_cn: 样式

# SkpStyles
source: styles
zh_cn: 个样式

# MaterialManager
source: materials list
fr: liste des matériaux
zh_cn: 材质列表

# LayerManager
source: layers list
fr: liste des calques
zh_cn: 图层列表

# PageList
source: scenes list
fr: list des scènes
zh_cn: 场景列表

source: rendering options
fr: options de rendu
zh_cn: 渲染选项

source: ShadowInfo
zh_cn: 阴影信息

# SkpStyleManager
source: style list
fr: liste des styles
zh_cn: 样式列表

# DefinitionList
source: component definitions list
fr: liste des définitions de composant
